MikroElektronika/core_packages/PIC/XC8/def/PIC18F86J15/mcu.h
// Register: PORTJ
#define PORTJ PORTJ
extern volatile unsigned char           PORTJ               __at(0xF88);
#ifndef _LIB_BUILD
asm("PORTJ equ 0F88h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RJ0                    :1;
        unsigned RJ1                    :1;
        unsigned RJ2                    :1;
        unsigned RJ3                    :1;
        unsigned RJ4                    :1;
        unsigned RJ5                    :1;
        unsigned RJ6                    :1;
        unsigned RJ7                    :1;
    };
    struct {
        unsigned ALE                    :1;
        unsigned OE                     :1;
        unsigned WRL                    :1;
        unsigned WRH                    :1;
        unsigned BA0                    :1;
        unsigned CE                     :1;
        unsigned LB                     :1;
        unsigned UB                     :1;
    };
} PORTJbits_t;
extern volatile PORTJbits_t PORTJbits __at(0xF88);
// bitfield macros
#define _PORTJ_RJ0_POSN                                     0x0
#define _PORTJ_RJ0_POSITION                                 0x0
#define _PORTJ_RJ0_SIZE                                     0x1
#define _PORTJ_RJ0_LENGTH                                   0x1
#define _PORTJ_RJ0_MASK                                     0x1
#define _PORTJ_RJ1_POSN                                     0x1
#define _PORTJ_RJ1_POSITION                                 0x1
#define _PORTJ_RJ1_SIZE                                     0x1
#define _PORTJ_RJ1_LENGTH                                   0x1
#define _PORTJ_RJ1_MASK                                     0x2
#define _PORTJ_RJ2_POSN                                     0x2
#define _PORTJ_RJ2_POSITION                                 0x2
#define _PORTJ_RJ2_SIZE                                     0x1
#define _PORTJ_RJ2_LENGTH                                   0x1
#define _PORTJ_RJ2_MASK                                     0x4
#define _PORTJ_RJ3_POSN                                     0x3
#define _PORTJ_RJ3_POSITION                                 0x3
#define _PORTJ_RJ3_SIZE                                     0x1
#define _PORTJ_RJ3_LENGTH                                   0x1
#define _PORTJ_RJ3_MASK                                     0x8
#define _PORTJ_RJ4_POSN                                     0x4
#define _PORTJ_RJ4_POSITION                                 0x4
#define _PORTJ_RJ4_SIZE                                     0x1
#define _PORTJ_RJ4_LENGTH                                   0x1
#define _PORTJ_RJ4_MASK                                     0x10
#define _PORTJ_RJ5_POSN                                     0x5
#define _PORTJ_RJ5_POSITION                                 0x5
#define _PORTJ_RJ5_SIZE                                     0x1
#define _PORTJ_RJ5_LENGTH                                   0x1
#define _PORTJ_RJ5_MASK                                     0x20
#define _PORTJ_RJ6_POSN                                     0x6
#define _PORTJ_RJ6_POSITION                                 0x6
#define _PORTJ_RJ6_SIZE                                     0x1
#define _PORTJ_RJ6_LENGTH                                   0x1
#define _PORTJ_RJ6_MASK                                     0x40
#define _PORTJ_RJ7_POSN                                     0x7
#define _PORTJ_RJ7_POSITION                                 0x7
#define _PORTJ_RJ7_SIZE                                     0x1
#define _PORTJ_RJ7_LENGTH                                   0x1
#define _PORTJ_RJ7_MASK                                     0x80
#define _PORTJ_ALE_POSN                                     0x0
#define _PORTJ_ALE_POSITION                                 0x0
#define _PORTJ_ALE_SIZE                                     0x1
#define _PORTJ_ALE_LENGTH                                   0x1
#define _PORTJ_ALE_MASK                                     0x1
#define _PORTJ_OE_POSN                                      0x1
#define _PORTJ_OE_POSITION                                  0x1
#define _PORTJ_OE_SIZE                                      0x1
#define _PORTJ_OE_LENGTH                                    0x1
#define _PORTJ_OE_MASK                                      0x2
#define _PORTJ_WRL_POSN                                     0x2
#define _PORTJ_WRL_POSITION                                 0x2
#define _PORTJ_WRL_SIZE                                     0x1
#define _PORTJ_WRL_LENGTH                                   0x1
#define _PORTJ_WRL_MASK                                     0x4
#define _PORTJ_WRH_POSN                                     0x3
#define _PORTJ_WRH_POSITION                                 0x3
#define _PORTJ_WRH_SIZE                                     0x1
#define _PORTJ_WRH_LENGTH                                   0x1
#define _PORTJ_WRH_MASK                                     0x8
#define _PORTJ_BA0_POSN                                     0x4
#define _PORTJ_BA0_POSITION                                 0x4
#define _PORTJ_BA0_SIZE                                     0x1
#define _PORTJ_BA0_LENGTH                                   0x1
#define _PORTJ_BA0_MASK                                     0x10
#define _PORTJ_CE_POSN                                      0x5
#define _PORTJ_CE_POSITION                                  0x5
#define _PORTJ_CE_SIZE                                      0x1
#define _PORTJ_CE_LENGTH                                    0x1
#define _PORTJ_CE_MASK                                      0x20
#define _PORTJ_LB_POSN                                      0x6
#define _PORTJ_LB_POSITION                                  0x6
#define _PORTJ_LB_SIZE                                      0x1
#define _PORTJ_LB_LENGTH                                    0x1
#define _PORTJ_LB_MASK                                      0x40
#define _PORTJ_UB_POSN                                      0x7
#define _PORTJ_UB_POSITION                                  0x7
#define _PORTJ_UB_SIZE                                      0x1
#define _PORTJ_UB_LENGTH                                    0x1
#define _PORTJ_UB_MASK                                      0x80

